dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2clib.c
    // Common hardware initialization regardless of mode
    I2C1CON0bits.EN = 0;    // Disable the module
    TRISCbits.TRISC3 = 0;   // set to output pin
    TRISCbits.TRISC4 = 0;   // set to output pin
    ANSELCbits.ANSELC3 = 0; // Digital mode
    ANSELCbits.ANSELC4 = 0; // Digital mode
    ODCONCbits.ODCC3 = 1;   // Open-drain configuration
    ODCONCbits.ODCC4 = 1;   // Open-drain configuration

    PPS_Unlock();
    RC3PPS = 0x37;         // RC3 -> I2C1 SCL
    RC4PPS = 0x38;         // RC4 -> I2C1 SDA
    I2C1SCLPPS = 0b010011; // I2C1 SCL -> RC3
    I2C1SDAPPS = 0b010100; // I2C1 SDA -> RC4
    PPS_Lock();
    __delay_us(100); // Delay to allow the I2C lines to stabilize after configuration

    I2C1PIR = 0x00;         // Clear all pending module events
    I2C1ERR = 0x00;         // Clear all pending error conditions and source enables
    I2C1ERRbits.NACKIE = 1; // Enable NACK error source
    I2C1ERRbits.BCLIE = 1;  // Enable bus collision error source
    I2C1ERRbits.BTOIE = 1;  // Enable bus-timeout error source
    I2C1PIE = 0x00;         // Clear module event interrupt enables before configuration
    I2C1PIEbits.SCIE = 1;   // Raise general I2C IRQ on START condition events
    I2C1PIEbits.RSCIE = 1;  // Raise general I2C IRQ on repeated START condition events
    I2C1PIEbits.PCIE = 1;   // Raise general I2C IRQ on STOP condition events
    I2C1PIEbits.ACKTIE = 1; // Raise general I2C IRQ on ACK timing events
    I2C1PIEbits.CNTIE = 1;  // Raise general I2C IRQ when the transfer byte count reaches zero

    IPR7bits.I2C1IP = 1;   // I2C General/event interrupt is high priority
    IPR7bits.I2C1EIP = 1;  // I2C Error interrupt is high priority
    IPR7bits.I2C1RXIP = 1; // I2C Receive interrupt is high priority
    IPR7bits.I2C1TXIP = 1; // I2C Transmit interrupt is high priority

    PIE7bits.I2C1IE = 1;   // General/event IRQ handles CNTIF transfer completion
    PIE7bits.I2C1EIE = 1;  // Enable vectored i2c error interrupts
    PIE7bits.I2C1RXIE = 1; // Enable vectored i2c RX interrupts
    PIE7bits.I2C1TXIE = 1; // TX interrupt advances each outgoing byte

    i2c_clearInterruptFags();

    I2C1CON0bits.MODE = (uint8_t)mode;
    switch (mode)
    {
    // Configure the I2C peripheral for host mode
    // (e.g., set baud rate, enable host mode, etc.)
    case I2C_MODE_HOST_7BIT:
    case I2C_MODE_HOST_10BIT:

        // compute the necessary clock source to use for the selected speed.
        // The Q43 family has multiple internal clock sources that can be used
        // for I2C.
        handle->speed_khz = speed;
        if (speed >= 400)
        {
            I2C1CLK = I2C_CLK_HFINTOSC; // Use HFINTOSC for higher speeds
            RC3I2Cbits.SLEW = 0b11;     // Use fast slew rate for higher speed operation
            RC3I2Cbits.I2CPU = 0b10;    // Use 10X pullups on RC3 for I2C SCL function
            RC3I2Cbits.I2CTH = 0b01;    // Use I2C standard thresholds for RC3
            RC4I2Cbits.SLEW = 0b11;     // Use fast slew rate for higher speed operation
            RC4I2Cbits.I2CPU = 0b10;    // Use 10X pullups on RC4 for I2C SDA function
            RC4I2Cbits.I2CTH = 0b01;    // Use I2C standard thresholds for RC4
        }
        else
        {
            I2C1CLK = I2C_CLK_MFINTOSC; // Use MFINTOSC for lower speeds
            RC3I2Cbits.SLEW = 0b01;     // Use slow slew rate for lower speed operation
            RC3I2Cbits.I2CPU = 0b01;    // Use 2X pullups on RC3 for I2C SCL function
            RC3I2Cbits.I2CTH = 0b01;    // Use I2C standard thresholds for RC3
            RC4I2Cbits.SLEW = 0b01;     // Use slow slew rate for lower speed operation
            RC4I2Cbits.I2CPU = 0b01;    // Use 2X pullups on RC4 for I2C SDA function
            RC4I2Cbits.I2CTH = 0b01;    // Use I2C standard thresholds for RC4
        }

        // Keep MODE from the assignment above; clearing I2C1CON0 here would force MODE=0.

        I2C1CON1 = 0x00;        // default everything else
        I2C1CON2 = 0x00;        // default everything else
        I2C1CON2bits.ABD = 0;   // Were using the address buffers
        I2C1CON2bits.SDAHT = 1; // Set SDA hold time to 300ns
        break;

    case I2C_MODE_CLIENT_7BIT:
    case I2C_MODE_CLIENT_10BIT:
        // Configure the I2C peripheral for client mode
        // (e.g., set own address, enable client mode, etc.)
        break;

    default:
        handle->status = I2C_ERROR_ILLEGAL_STATE; // Invalid mode specified, handle error as needed
        CRITICAL_SECTION_END();
        return I2C_ERROR_ILLEGAL_STATE;
    }

    I2C1CON0bits.EN = 1; // Enable module after final CON0 mode configuration
    handle->initialized = true;
    CRITICAL_SECTION_END();
    return I2C_SUCCESS;
}

/// @brief Writes data to the specified I2C client device. This function initiates an
/// I2C write transaction to the given address, transmitting the specified data bytes.
/// The function will handle the necessary I2C protocol steps, including generating the
/// start condition, transmitting the address and data bytes, and generating the stop
/// condition. The status of the operation will be returned to indicate success or any
/// errors that may have occurred during the transaction.
/// @param handle Pointer to the I2C handle structure.
/// @param address The 7-bit I2C address of the target device.
/// @param data Pointer to the data buffer to be transmitted.
/// @param length Number of bytes to be transmitted.
/// @return The status of the I2C write operation.
i2c_status_t i2c_writeClient(i2c_handle_t *handle, uint16_t address, const uint8_t *data,
                             uint8_t length)
{
    if ((handle == NULL) || (!handle->initialized))
    {
        return I2C_ERROR_NOT_INITIALIZED; // Handle is not initialized, cannot perform write operation
    }

    if ((data == NULL) || (length == 0))
    {
        return I2C_ERROR_ILLEGAL_STATE; // Invalid data buffer or length, cannot perform write operation
    }

    if ((active_handle != NULL) || (handle->current_operation != I2C_OP_NONE))
    {
        return I2C_ERROR_ILLEGAL_STATE; // A transfer is already in progress
    }

    active_handle = handle; // Set the active handle for use in the ISRs

    // Track the users buffer and length in the handle for use in the ISR.
    // The actual transmission of data will be handled by the ISR.
    I2C1CON0bits.RSEN = 0; // A plain write must not inherit a pending repeated-start request.
    handle->tx_buffer = data;
    handle->tx_buffer_size = length;
    handle->tx_buffer_pos = 0;
    handle->repeated_start_pending = false;
    handle->current_operation = I2C_OP_WRITE; // Set the current operation to write

    // Initiate the I2C write transaction to the specified address
    // (e.g., generate start condition, send address with write bit, etc.)
    // The actual implementation of the I2C write transaction will depend on the
    // specific hardware and may involve setting registers and handling interrupts.
    switch (handle->mode)
    {
    case I2C_MODE_HOST_7BIT:
    {
        i2c_address7_t addr7 = format_7bit_address((uint8_t)address, false); // Format the 7-bit address with the write bit
        active_handle->device_address.address7 = addr7;                      // Store the formatted address in the handle for ISR access
        I2C1ADB1 = addr7.address_l;                                          // Load the 7-bit address into ADB1, ensuring the R/W bit is cleared for write
        I2C1ADB0 = 0x00;                                                     // Clear ADB0 since we're using ADB1 for the address in 7-bit host mode
        break;
    }
    case I2C_MODE_HOST_10BIT:
    {
        i2c_address10_t addr10 = format_10bit_address(address, false); // Format the 10-bit address with the write bit
        active_handle->device_address.address10 = addr10;              // Store the formatted address in the handle for ISR access
        I2C1ADB0 = addr10.address_l;                                   // Load the low byte of the 10-bit address into ADB0
        I2C1ADB1 = addr10.address.address_h;                           // Load the high part of the 10-bit address into ADB1
        break;
    }
    default:
        return I2C_ERROR_ILLEGAL_STATE;
    }
    // CNT is total payload byte count (includes the preloaded TXB data byte).
    I2C1CNT = length;
    I2C1TXB = handle->tx_buffer[0]; // Load the first byte of data to send into the TX buffer to prime the transfer
    handle->tx_pos = 1;             // Set the position for the next byte to send
    I2C1CON0bits.S = 1;             // Assert the start condition to begin the transfer

