dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2clib.c
    return I2C_SUCCESS; // Return success status for now (actual implementation needed)
}

/// @brief Reads data from the specified I2C client device. This function initiates an
/// I2C read transaction from the given address, receiving the specified number of data
/// bytes. The function will handle the necessary I2C protocol steps, including generating
/// the start condition, transmitting the address with the read bit, receiving the data
/// bytes, and generating the stop condition. The received data will be stored in the
/// provided buffer, and the status of the operation will be returned to indicate success
/// or any errors that may have occurred during the transaction.
/// @param handle Pointer to the I2C handle structure.
/// @param address The 7-bit I2C address of the target device.
/// @param data Pointer to the buffer where the received data will be stored.
/// @param length Number of bytes to be received.
/// @return The status of the I2C read operation.
i2c_status_t i2c_readClient(i2c_handle_t *handle, uint16_t address, uint8_t *data,
                            uint8_t length)
{
    if ((handle == NULL) || (!handle->initialized))
    {
        return I2C_ERROR_NOT_INITIALIZED; // Handle is not initialized, cannot perform read operation
    }

    if ((data == NULL) || (length == 0))
    {
        return I2C_ERROR_ILLEGAL_STATE; // Invalid data buffer or length, cannot perform read operation
    }

    if ((active_handle != NULL) || (handle->current_operation != I2C_OP_NONE))
    {
        return I2C_ERROR_ILLEGAL_STATE; // A transfer is already in progress
    }

    active_handle = handle; // Set the active handle for use in the ISRs

    // Track the users buffer and length in the handle for use in the ISR.
    // The actual reception of data will be handled by the ISR.
    I2C1CON0bits.RSEN = 0; // A plain read must not inherit a pending repeated-start request.
    handle->rx_buffer = data;
    handle->rx_buffer_size = length;
    handle->rx_buffer_pos = 0;
    handle->repeated_start_pending = false;
    handle->current_operation = I2C_OP_READ; // Set the current operation to read

    // Initiate the I2C write transaction to the specified address
    // (e.g., generate start condition, send address with write bit, etc.)
    // The actual implementation of the I2C write transaction will depend on the
    // specific hardware and may involve setting registers and handling interrupts.
    switch (handle->mode)
    {
    case I2C_MODE_HOST_7BIT:
    {
        i2c_address7_t addr7 = format_7bit_address((uint8_t)address, true); // Format the 7-bit address with the read bit
        active_handle->device_address.address7 = addr7;                      // Store the formatted address in the handle for ISR access
        I2C1ADB1 = addr7.address_l;                                          // Load the 7-bit address into ADB1, ensuring the R/W bit is cleared for write
        I2C1ADB0 = 0x00;                                                     // Clear ADB0 since we're using ADB1 for the address in 7-bit host mode
        break;
    }
    case I2C_MODE_HOST_10BIT:
    {
        i2c_address10_t addr10 = format_10bit_address(address, true); // Format the 10-bit address with the read bit
        active_handle->device_address.address10 = addr10;              // Store the formatted address in the handle for ISR access
        I2C1ADB0 = addr10.address_l;                                   // Load the low byte of the 10-bit address into ADB0
        I2C1ADB1 = addr10.address.address_h;                           // Load the high part of the 10-bit address into ADB1
        break;
    }
    default:
        return I2C_ERROR_ILLEGAL_STATE;
    }
    I2C1CNT = length;   // Load the byte count (not including address)
    handle->rx_pos = 0; // Set the position for the next byte to receive
    I2C1CON0bits.S = 1; // Assert the start condition to begin the transfer

    return I2C_SUCCESS; // Return success status for now (actual implementation needed)
}

/// @brief Performs a combined write-read transaction to the specified I2C
/// client device. This function initiates an I2C write transaction to the
/// given address, transmitting the specified data, followed by an I2C read
/// transaction to receive data from the same address. The function will handle
/// the necessary I2C protocol steps, including generating the start condition,
/// transmitting the address and write data bytes, generating a repeated start
/// condition, transmitting the address with the read bit, receiving the read
/// data bytes, and generating the stop condition. The received data will be
/// stored in the provided buffer, and the status of the operation will be
/// returned to indicate success or any errors that may have occurred during the
/// transaction.
/// @param handle Pointer to the I2C handle structure.
/// @param address The 7-bit I2C address of the target device.
/// @param write_data Pointer to the data buffer to be transmitted in the write phase.
/// @param write_length Number of bytes to be transmitted in the write phase.
/// @param read_data Pointer to the buffer where the received data will be stored in the read phase.
/// @param read_length Number of bytes to be received in the read phase.
/// @return The status of the I2C write-read operation.
i2c_status_t i2c_writeReadClient(i2c_handle_t *handle, uint16_t address, uint8_t write_byte,
                                 uint8_t *read_data, uint8_t read_length)
{
    if ((handle == NULL) || (!handle->initialized))
    {
        return I2C_ERROR_NOT_INITIALIZED; // Handle is not initialized, cannot perform write-read operation
    }

    if ((read_data == NULL) || (read_length == 0))
    {
        return I2C_ERROR_ILLEGAL_STATE; // Invalid data buffers or lengths, cannot perform write-read operation
    }

    if ((active_handle != NULL) || (handle->current_operation != I2C_OP_NONE))
    {
        return I2C_ERROR_ILLEGAL_STATE; // A transfer is already in progress
    }

    // Track the user's write and read buffers and lengths in the handle for use in the ISR.
    // The actual transmission and reception of data will be handled by the ISR.
    I2C1CON0bits.RSEN = 0; // Reset restart request first; writeRead is the only path that re-arms it.
    handle->tx_buffer = NULL;
    handle->tx_buffer_size = 1;
    handle->tx_buffer_pos = 0;
    handle->rx_buffer = read_data;
    handle->rx_buffer_size = read_length;
    handle->rx_buffer_pos = 0;
    handle->repeated_start_pending = true;
    handle->current_operation = I2C_OP_WRITE_READ; // Set the current operation state

    // Initiate the I2C write transaction to the specified address
    // (e.g., generate start condition, send address with write bit, etc.)
    // The actual implementation of the I2C write transaction will depend on the
    // specific hardware and may involve setting registers and handling interrupts.
    active_handle = handle; // Set the active handle for use in the ISRs
    switch (handle->mode)
    {
    case I2C_MODE_HOST_7BIT:
    {
        i2c_address7_t addr7 = format_7bit_address((uint8_t)address, false); // Format the 7-bit address with the write bit
        active_handle->device_address.address7 = addr7;                      // Store the formatted address in the handle for ISR access
        I2C1ADB1 = addr7.address_l;                                          // Load the 7-bit address into ADB1, ensuring the R/W bit is cleared for write
        I2C1ADB0 = 0x00;                                                     // Clear ADB0 since we're using ADB1 for the address in 7-bit host mode
        break;
    }
    case I2C_MODE_HOST_10BIT:
    {
        i2c_address10_t addr10 = format_10bit_address(address, false); // Format the 10-bit address with the write bit
        active_handle->device_address.address10 = addr10;              // Store the formatted address in the handle for ISR access
        I2C1ADB0 = addr10.address_l;                                   // Load the low byte of the 10-bit address into ADB0
        I2C1ADB1 = addr10.address.address_h;                           // Load the high part of the 10-bit address into ADB1
        break;
    }
    default:
        return I2C_ERROR_ILLEGAL_STATE;
    }
    // CNT is total payload byte count (includes the preloaded TXB data byte).
    I2C1CNT = 1;          // One write byte precedes the repeated start
    I2C1TXB = write_byte; // Prime the register address / command byte
    handle->tx_pos = 1;   // Write phase is fully queued
    I2C1CON0bits.RSEN = 1; // Arm repeated-start request before starting the write phase
    I2C1CON0bits.S = 1;    // Assert the start condition to begin the transfer

