dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2clib.c
    return I2C_SUCCESS; // Return success status for now (actual implementation needed)
}

/// @brief Checks if the current I2C transfer associated with the handle is complete.
/// This function can be used by the user to poll the status of an ongoing I2C transfer
/// to determine if it has completed.
/// @param handle Pointer to the I2C handle structure.
/// @return true if the transfer is complete, false if the transfer is still in progress
/// or if the handle is not initialized.
bool i2c_isComplete(i2c_handle_t *handle)
{
    if ((handle == NULL) || (!handle->initialized))
    {
        return false; // Handle is not initialized, cannot determine completion status
    }
    
    return (handle->current_operation == I2C_OP_NONE); // Transfer is complete if there is no current operation
}

/// @brief Waits for the current I2C transfer associated with the handle to complete. This
/// function will block execution until the transfer is complete, allowing the user to wait
/// for the completion of an I2C operation before proceeding with further actions. The function
/// will check the status of the transfer using the i2c_isComplete function and will return
/// once the transfer is finished.
/// @param handle Pointer to the I2C handle structure.
/// @return The status of the wait operation, indicating success or if the handle was not
/// initialized.
i2c_status_t i2c_waitComplete(i2c_handle_t *handle)
{
    if ((handle == NULL) || (!handle->initialized))
    {
        return I2C_ERROR_NOT_INITIALIZED; // Handle is not initialized, cannot wait for completion
    }

    uint16_t loops = 0;
    while (!i2c_isComplete(handle))
    {
        __delay_us(100);
        loops++;
        if (loops >= 60000U) // ~6 seconds total wait
        {
            handle->status = I2C_ERROR_TIMEOUT;
            i2c_printDiagnostics(handle, "waitComplete timeout");
            return I2C_ERROR_TIMEOUT;
        }
    }

    return I2C_SUCCESS; // Transfer completed successfully
}

/// @brief Print a concise diagnostics dump of the I2C software state and key
/// I2C1 hardware registers.
/// @param handle Pointer to the I2C handle structure to inspect.
/// @param title Optional title to display in the diagnostics output.
/// @return None.
void i2c_printDiagnostics(i2c_handle_t *handle, char* title)
{
    if (title != NULL)
    {
        printf("\r\n[I2C DIAG] %s ------------------------------\r\n", title);
    }
    else
    {
        printf("\r\n[I2C DIAG] ------------------------------\r\n");
    }
    printf("handle=%s active=%s\r\n",
           (handle != NULL) ? "set" : "null",
           (active_handle != NULL) ? "set" : "null");

    if (handle != NULL)
    {
        printf("init=%u sig=0x%04X mode=%u ch=%u speed_khz=%u\r\n",
               (unsigned)handle->initialized,
               (unsigned)handle->signature,
               (unsigned)handle->mode,
               (unsigned)handle->channel,
               (unsigned)handle->speed_khz);
        printf("status=%u op=%u retry=%u\r\n",
               (unsigned)handle->status,
               (unsigned)handle->current_operation,
               (unsigned)handle->retry_count);
        printf("tx_size=%u tx_pos=%u tx_buf_pos=%u\r\n",
               (unsigned)handle->tx_buffer_size,
               (unsigned)handle->tx_pos,
               (unsigned)handle->tx_buffer_pos);
        printf("rx_size=%u rx_pos=%u rx_buf_pos=%u\r\n",
               (unsigned)handle->rx_buffer_size,
               (unsigned)handle->rx_pos,
               (unsigned)handle->rx_buffer_pos);
    }

    printf("CON0=0x%02X CON1=0x%02X CON2=0x%02X CLK=0x%02X CNT=%u\r\n",
           (unsigned)I2C1CON0,
           (unsigned)I2C1CON1,
           (unsigned)I2C1CON2,
           (unsigned)I2C1CLK,
           (unsigned)I2C1CNT);
    printf("STAT0=0x%02X STAT1=0x%02X ERR=0x%02X PIR=0x%02X PIE=0x%02X\r\n",
           (unsigned)I2C1STAT0,
           (unsigned)I2C1STAT1,
           (unsigned)I2C1ERR,
           (unsigned)I2C1PIR,
           (unsigned)I2C1PIE);
    printf("ADB1=0x%02X ADB0=0x%02X TXB=0x%02X RXB=0x%02X\r\n",
           (unsigned)I2C1ADB1,
           (unsigned)I2C1ADB0,
           (unsigned)I2C1TXB,
           (unsigned)I2C1RXB);
    printf("PIR7=0x%02X PIE7=0x%02X IPR7=0x%02X\r\n",
           (unsigned)PIR7,
           (unsigned)PIE7,
           (unsigned)IPR7);
    printf("[I2C DIAG] --------------------------------\r\n");
}

/// @brief The I2C "Error" interrupt service routine. This ISR is triggered when an error condition
/// occurs on the I2C bus, such as a NACK received, bus collision, or other error events as
/// indicated by the flags in the I2C Peripheral Interrupt Register (I2C1PIR) and the I2C Error
/// Register (I2C1ERR). The ISR will need to check the specific error flags to determine the
/// cause of the error and take appropriate action, such as clearing the error flags, updating
/// the transfer status, and signaling any waiting tasks or callbacks about the error condition.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1E), high_priority) i2c1_errorISR(void)
{
    // Check for specific error conditions based on the flags in I2C1PIR and I2C1ERR
    // and take appropriate action (e.g., clear flags, update status, signal waiting tasks, etc.)
    if (I2C1ERRbits.NACKIF) // Check for NACK received error
    {
        I2C1ERRbits.NACKIF = 0; // Clear the NACK error flag
        if (active_handle != NULL)
            active_handle->status = I2C_ERROR_NACK_RECEIVED; // Update the handle status to indicate a NACK error
        // Additional error handling actions can be taken here (e.g., signal waiting tasks, reset state, etc.)
    }
    if (I2C1ERRbits.BCLIF) // Check for bus collision error
    {
        I2C1ERRbits.BCLIF = 0; // Clear the bus collision error flag
        if (active_handle != NULL)
            active_handle->status = I2C_ERROR_BUS_COLLISION; // Update the handle status to indicate a bus collision error
        // Additional error handling actions can be taken here (e.g., signal waiting tasks, reset state, etc.)
    }
    // Check for other error conditions as needed and handle them accordingly

