dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2clib.c
    if (active_handle != NULL)
        active_handle->current_operation = I2C_OP_NONE; // Clear the current operation state due to the error
    active_handle = NULL;                               // Clear the active handle since the transfer is now complete due to the error
    PIR7bits.I2C1EIF = 0;                               // Clear top-level error interrupt flag
    // The ISR will automatically stop being called once the transfer is complete and the handle
}

/// @brief The I2C "General" interrupt service routine. This ISR handles module event
/// conditions exposed through I2C1PIR. We use CNTIF as the authoritative indication that
/// the current transfer byte count has reached zero.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1), high_priority) i2c1_generalISR(void)
{
    // Debug LED map for general events:
    // LED0 = START detected/generated
    // LED1 = repeated START detected/generated
    // LED2 = STOP detected/generated
    // LED3 = transfer count reached zero
    // LED4 = ACK timing event detected
    // LED5 = write-read transition armed (read phase prepared)
    // LED6 = stale write-phase CNTIF ignored
    // LED7 = true operation completion (WRITE or READ)
    if (I2C1PIRbits.SCIF)
    {
        debug_led0(true);
        I2C1PIRbits.SCIF = 0;
    }

    if (I2C1PIRbits.RSCIF)
    {
        debug_led1(true);
        I2C1PIRbits.RSCIF = 0;
    }

    if (I2C1PIRbits.PCIF)
    {
        debug_led2(true);
        I2C1PIRbits.PCIF = 0;
    }

    if (I2C1PIRbits.ACKTIF)
    {
        debug_led4(true);
        I2C1PIRbits.ACKTIF = 0; // Clear the module ACK timing condition
    }

    if (I2C1PIRbits.CNTIF)
    {
        debug_led3(true);
        I2C1PIRbits.CNTIF = 0; // Clear the module count-complete condition

        // For write-read transfers, count-complete of the write byte is the boundary where
        // the peripheral can be armed for the repeated-start read phase without injecting
        // extra write data.
        if (i2c_tryArmWriteReadReadPhase())
        {
            debug_led5(true);
            PIR7bits.I2C1IF = 0;
            return;
        }

        if ((active_handle != NULL) &&
            (active_handle->current_operation == I2C_OP_WRITE))
        {
            debug_led7(true);
            active_handle->current_operation = I2C_OP_NONE;
            active_handle = NULL;
        }
        else if ((active_handle != NULL) &&
                 (active_handle->current_operation == I2C_OP_READ))
        {
            // Ignore stale CNTIF from the completed write phase of a write-read transfer.
            // Final completion of reads is confirmed once RX has filled the caller buffer.
            if (active_handle->rx_pos >= active_handle->rx_buffer_size)
            {
                debug_led7(true);
                active_handle->current_operation = I2C_OP_NONE;
                active_handle = NULL;
            }
            else
            {
                debug_led6(true);
            }
        }
    }

    PIR7bits.I2C1IF = 0; // Clear top-level general interrupt flag
}

/// @brief The I2C "Transmit" interrupt service routine.
/// This interupt is generated whenever the I2C1CNT (count) register is not zero and the
/// transmit buffer is empty, indicating that the next byte can be transmitted. The ISR will need
/// to check the current state of the transfer, load the next byte to transmit into the appropriate
/// register, and update the transfer status accordingly. The ISR may also need to check for
/// conditions such as the byte count being complete, a repeated start condition being needed for
/// a write-read operation, or an error condition occurring during transmission, and take
/// appropriate action based on those conditions.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1TX), high_priority) i2c1_transmitISR(void)
{
    if (active_handle == NULL || !active_handle->initialized ||
        (active_handle->current_operation != I2C_OP_WRITE && active_handle->current_operation != I2C_OP_WRITE_READ))
    {
        PIR7bits.I2C1TXIF = 0;
        return;
    }

    // Check if there are more bytes to transmit
    if (active_handle->tx_pos < active_handle->tx_buffer_size)
    {
        I2C1TXB = active_handle->tx_buffer[active_handle->tx_pos]; // Load the next byte to transmit
        active_handle->tx_pos++;                                   // Move to the next byte position
    }
    else
    {
        // Everything to transmit has been sent.
        // For write-read transfers, the CNTIF path arms the read phase.
        if (active_handle->current_operation == I2C_OP_WRITE_READ)
        {
            PIR7bits.I2C1TXIF = 0;
            return;
        }
        else
        {
            // All bytes have been transmitted for a write-only operation, we can complete the transfer now.
            // STOP is generated by the hardware sequence as the transfer counter completes.
            active_handle->current_operation = I2C_OP_NONE; // Clear the current operation state
            active_handle = NULL;                           // Clear the active handle since the transfer is complete
            // The ISR will automatically stop being called once the transfer is complete and the handle
            // is cleared
        }
    }
}

/// @brief The I2C "Receive" interrupt service routine.
/// This ISR is triggered when a byte has been received on the I2C bus and is available in the
/// receive buffer. The ISR will need to read the received byte from the appropriate register,
/// store it in the user's buffer, and update the transfer status accordingly. The ISR may also
/// need to check for conditions such as the byte count being complete, a stop condition being
/// detected, or an error condition occurring during reception, and take appropriate action
/// based on those conditions.
void __attribute__((weak)) __interrupt(irq(IRQ_I2C1RX), high_priority) i2c1_receiveISR(void)
{
    if (active_handle == NULL || !active_handle->initialized ||
        (active_handle->current_operation != I2C_OP_READ && active_handle->current_operation != I2C_OP_WRITE_READ))
    {
        PIR7bits.I2C1RXIF = 0;
        return;
    }

    I2C1CON0bits.RSEN = 0; // Restart disabled
    active_handle->repeated_start_pending = false;
    // Check if there is space in the user's buffer to store the received byte
    if (active_handle->rx_pos < active_handle->rx_buffer_size)
    {
        active_handle->rx_buffer[active_handle->rx_pos] = I2C1RXB; // Read the received byte into the user's buffer
        active_handle->rx_pos++;                                   // Move to the next byte position

        if (active_handle->rx_pos >= active_handle->rx_buffer_size)
        {
            active_handle->current_operation = I2C_OP_NONE;
            active_handle = NULL;
            debug_led7(true);
        }
    }
    else
    {
        // Buffer overflow condition - more bytes received than the user's buffer can hold
        // Handle this condition as needed (e.g., discard additional bytes, set an error status, etc.)
        active_handle->status = I2C_ERROR_BUFFER_OVERFLOW; // Update the handle status to indicate a buffer overflow error
    }

    PIR7bits.I2C1RXIF = 0;
}